// פונקציית עזר: חישוב עצרת (Factorial) או סתם לולאת מתמטיקה כבדה
// הפונקציה הזו תשב בכתובת אחת בזיכרון, והמעבד יצטרך לקפוץ אליה המון פעמים.
int complex_math(int x) {
    int res = 0;
    for(int i = 0; i <= x; i++) {
        res += (i * 2) - 1;
    }
    return res;
}

// הפונקציה הראשית
int main() {
    int data_array[8];
    int total_sum = 0;

    // לולאה 1: קוראת לפונקציה חיצונית. 
    // זה יאתגר את המטמון כי ה-PC קופץ הלוך ושוב בין ה-main לפונקציה.
    for (int i = 0; i < 8; i++) {
        data_array[i] = complex_math(i + 3);
    }

    // לולאה 2: עיבוד נתונים
    // כאן הקוד של הפונקציה כבר לא בשימוש, אז קוד הלולאה הזה כנראה
    // ידרוס אותו בתוך ה-Cache (Capacity Miss).
    for (int i = 0; i < 8; i++) {
        total_sum += data_array[i];
    }

    // מלכודת סיום: לולאה אינסופית כדי שהסימולציה לא תברח לכתובות לא קיימות
    while(1) {
        total_sum = total_sum; // מונע מהקומפיילר למחוק את הלולאה
    }
    
    return total_sum;
}